<a href="https://colab.research.google.com/github/ejrtks1020/Bigdata_Analysis_Certification/blob/main/T1_19_%EC%8B%9C%EA%B3%84%EC%97%B4_%EB%8D%B0%EC%9D%B4%ED%84%B03_Expected_Question.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

주어진 데이터에서 2022년 월별 Sales 합계 중 가장 큰 금액과
2023년 월별 Sales 합계 중 가장 큰 금액의 차이를 절대값으로 구하시오.
단 Events컬럼이 '1'인경우 80%의 Salse값만 반영함
(최종값은 소수점 반올림 후 정수 출력)

In [ ]:
import pandas as pd

df = pd.read_csv('basic2.csv')

In [ ]:
df.head()

         Date     Sales      PV      UV  Events
0  2022-01-01  22711525  397349  4421.0       1
1  2022-01-02     36779    3969  2289.0       0
2  2022-01-03  13943875  373890     NaN       1
3  2022-01-04   8088593  142054  2157.0       0
4  2022-01-05   2395374  190684     NaN       0

In [ ]:
df['Date'] = pd.to_datetime(df['Date'])

In [ ]:
df['year'] = df['Date'].dt.year
df['month'] = df['Date'].dt.month
df['day'] = df['Date'].dt.day

In [ ]:
df.head()

        Date     Sales      PV      UV  Events  year  month  day
0 2022-01-01  22711525  397349  4421.0       1  2022      1    1
1 2022-01-02     36779    3969  2289.0       0  2022      1    2
2 2022-01-03  13943875  373890     NaN       1  2022      1    3
3 2022-01-04   8088593  142054  2157.0       0  2022      1    4
4 2022-01-05   2395374  190684     NaN       0  2022      1    5

In [ ]:
df.loc[df['Events'] == 1, 'Sales'] *= 0.8

In [ ]:
df.head()

        Date       Sales      PV      UV  Events  year  month  day
0 2022-01-01  18169220.0  397349  4421.0       1  2022      1    1
1 2022-01-02     36779.0    3969  2289.0       0  2022      1    2
2 2022-01-03  11155100.0  373890     NaN       1  2022      1    3
3 2022-01-04   8088593.0  142054  2157.0       0  2022      1    4
4 2022-01-05   2395374.0  190684     NaN       0  2022      1    5

In [ ]:
df2 = df[df['year'] == 2022]

In [ ]:
year_2022_max = df2.groupby('month')[['Sales']].sum().max()

In [ ]:
df3 = df[df['year'] == 2023]

In [ ]:
df3.head()

          Date       Sales      PV      UV  Events  year  month  day
365 2023-01-01  31571496.8  457995  6716.0       1  2023      1    1
366 2023-01-02    169945.0    2134   247.0       0  2023      1    2
367 2023-01-03    144534.0    3399   371.0       0  2023      1    3
368 2023-01-04   1335449.0   18192   545.0       0  2023      1    4
369 2023-01-05   6731190.0   76194  1580.0       0  2023      1    5

In [ ]:
year_2023_max = df3.groupby('month')[['Sales']].sum().max()

In [ ]:
int(round(abs(year_2022_max - year_2023_max), 0))

42473436

In [ ]:
df['year'].unique()

array([2022, 2023])